qemu-user-targets/CVE-2015-2051/squashfs-root/htdocs/web/hnap/SetRouterSettings.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<SetRouterSettings xmlns="http://purenetworks.com/HNAP1/">
	<ManageRemote></ManageRemote>
	<ManageWireless></ManageWireless>
	<RemoteSSL></RemoteSSL>
	<RemotePort></RemotePort>
	<DomainName></DomainName>
	<WiredQoS></WiredQoS>
</SetRouterSettings>
</soap:Body>
</soap:Envelope>